
### :hammer_and_wrench: Infrastructure Change requtested
:file_folder: Terragrant File updated in `env/dev`

---

### :memo: View the Plan

<details>
  <summary>Terragrunt Plan</summary>

  Plan:

  ```txt
  Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "dev content test"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "dev"
      + id                   = (known after apply)
    }
Plan: 1 to add, 0 to change, 0 to destroy.


  ```
</details>

---

:checkered_flag: Review and Merge the PR to Apply the Changes...

